In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
# Importing all CSV files
reviews = pd.read_csv('C:/Users/Jing/Desktop/Galvanize_Capstones/JingWu-Capstone2/DATA/reviews.csv')
neighbourhoods = pd.read_csv('C:/Users/Jing/Desktop/Galvanize_Capstones/JingWu-Capstone2/DATA/neighbourhoods.csv')
listings = pd.read_csv('C:/Users/Jing/Desktop/Galvanize_Capstones/JingWu-Capstone2/DATA/listings.csv')

# Importing the csv.gz files
reviews_content = pd.read_csv('C:/Users/Jing/Desktop/Galvanize_Capstones/JingWu-Capstone2/DATA/reviews.csv.gz')
calendar_content = pd.read_csv('C:/Users/Jing/Desktop/Galvanize_Capstones/JingWu-Capstone2/DATA/calendar.csv.gz')

In [85]:
# Table where available is false
x = calendar_content.loc[calendar_content.available == 't']
x
x.date.value_counts().sort_index(axis=0)
# 3369 on June 9th were booked. looks like it's sorted by value counts
# count is 366, counting dates just over one year
# df = pd.DataFrame({'a':list('abssbab')})df.groupby('a').count()

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,12899,2020-06-09,t,$75.00,$75.00,2.0,1125.0
1,12899,2020-06-10,t,$75.00,$75.00,2.0,1125.0
2,12899,2020-06-11,t,$75.00,$75.00,2.0,1125.0
3,12899,2020-06-12,t,$75.00,$75.00,2.0,1125.0
4,12899,2020-06-13,t,$75.00,$75.00,2.0,1125.0
...,...,...,...,...,...,...,...
1588500,43381640,2021-06-04,t,$271.00,$271.00,2.0,1125.0
1588501,43381640,2021-06-05,t,$292.00,$292.00,2.0,1125.0
1588502,43381640,2021-06-06,t,$219.00,$219.00,2.0,1125.0
1588503,43381640,2021-06-07,t,$184.00,$184.00,2.0,1125.0
1588504,43381640,2021-06-08,t,$186.00,$186.00,2.0,1125.0

In [53]:
calendar_content.head()
calendar_content.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1588505 entries, 0 to 1588504
Data columns (total 7 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   listing_id      1588505 non-null  int64
 1   date            1588505 non-null  object
 2   available       1588505 non-null  object
 3   price           1588334 non-null  object
 4   adjusted_price  1588334 non-null  object
 5   minimum_nights  1588499 non-null  float64
 6   maximum_nights  1588499 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 84.8+ MB

AttributeError: 'DataFrame' object has no attribute 'value_counts'

In [75]:
# import gzip
# with gzip.open('listings.csv.gz') as l:
#     listings_content = l.read()
len(reviews_content.loc[reviews_content.listing_id == 12899])
# id means no clue, but this includes all the reviews for one listing

544

In [74]:
# import gzip
# with gzip.open('calendar.csv.gz') as c:
#     calendar_content = c.read()
listings.loc[listings.id == 12899]
# listings.id = review_content.listing_id WHEN DOING JOIN

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,12899,"Alberta Arts 2 bedroom suite, charming 1906 house",49682,Ali And David,NaN,Concordia,45.56488,-122.63418,Entire home/apt,75,2,544,2020-04-22,4.31,1,343

### Exploring Reviews dataset

In [6]:
reviews.head()

   listing_id        date
0       12899  2010-01-24
1       12899  2010-03-13
2       12899  2010-03-16
3       12899  2010-03-31
4       12899  2010-04-02

In [7]:
reviews.columns

Index(['listing_id', 'date'], dtype='object')

In [9]:
reviews.shape

(353566, 2)

In [12]:
reviews.tail()
# could group by listing_id, find difference between dates to see how much time was between each bookings

        listing_id        date
353561    43381333  2020-05-31
353562    43381333  2020-06-01
353563    43381333  2020-06-07
353564    43452673  2020-05-17
353565    43605048  2020-06-01

### Exploring neighbourhoods dataset

In [13]:
neighbourhoods.head()

   neighbourhood_group            neighbourhood
0                  NaN                  Alameda
1                  NaN              Arbor Lodge
2                  NaN  Ardenwald-Johnson Creek
3                  NaN                    Argay
4                  NaN        Arlington Heights

In [14]:
neighbourhoods.tail()

    neighbourhood_group       neighbourhood
90                  NaN  West Portland Park
91                  NaN              Wilkes
92                  NaN       Woodland Park
93                  NaN            Woodlawn
94                  NaN           Woodstock

In [15]:
neighbourhoods.columns

Index(['neighbourhood_group', 'neighbourhood'], dtype='object')

In [22]:
neighbourhoods.shape

(95, 2)

In [24]:
neighbourhoods.neighbourhood_group.value_counts()

Series([], Name: neighbourhood_group, dtype: int64)

In [21]:
# seems like everything in neighbourhood_group is null. May keep the column, could group them into neighbourhoods
neighbourhoods.loc[neighbourhoods.neighbourhood_group.isna()]

    neighbourhood_group            neighbourhood
0                   NaN                  Alameda
1                   NaN              Arbor Lodge
2                   NaN  Ardenwald-Johnson Creek
3                   NaN                    Argay
4                   NaN        Arlington Heights
..                  ...                      ...
90                  NaN       West Portland Park
91                  NaN                   Wilkes
92                  NaN            Woodland Park
93                  NaN                 Woodlawn
94                  NaN                Woodstock

[95 rows x 2 columns]

In [31]:
# pd.options.display.max_rows = 999

# neighbourhoods

### Exploring listings dataset

In [32]:
listings.columns

Index(['id', 'name', 'host_id', 'host_name', 'neighbourhood_group',
       'neighbourhood', 'latitude', 'longitude', 'room_type', 'price',
       'minimum_nights', 'number_of_reviews', 'last_review',
       'reviews_per_month', 'calculated_host_listings_count',
       'availability_365'],
      dtype='object')

In [33]:
listings.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,12899,"Alberta Arts 2 bedroom suite, charming 1906 house",49682,Ali And David,NaN,Concordia,45.56488,-122.63418,Entire home/apt,75,2,544,2020-04-22,4.31,1,343
1,16688,"Beautiful condo in downtown Pearl, NW Portland",64840,Ashish,NaN,Pearl,45.52542,-122.68557,Entire home/apt,275,2,82,2020-03-19,2.16,1,354
2,29931,Lovely SW Victorian w/Bonus Room and Hot Tub,79786,Ken,NaN,Hayhurst,45.48278,-122.72089,Entire home/apt,200,2,53,2019-08-31,0.44,3,8
3,37676,Mt. Hood View in the Pearl District,162158,Paul,NaN,Pearl,45.52555,-122.68193,Entire home/apt,125,30,123,2019-10-11,1.02,2,365
4,39938,Friendly Guesthouse / 10 Min to Airport & Down...,171371,Sarah,NaN,Woodlawn,45.57428,-122.64594,Private room,29,30,274,2019-11-18,4.29,3,90